package practice01;

/* 問題3
以下の指示と条件と実行結果に従ってプログラムを行ってください。

変数名 	              型 	       初期値 	     概要
-----------------------------------------------------
price 	              int 	        9260 	     金額を保存する
discount_rate 	  int 	        33 	         割引率を保存する
day_of_week 	  char     ‘土’ 	     曜日を保存する
day_of_month    int 	         1 	         日を保存する

条件1：土曜日の場合、割引率を1.2倍し、
           「土曜日は割引率アップ！」を追加表示

条件2：土曜日でかつ、5の付く日の場合、（5日、15日、25日）割引率を1.5倍し、
           「5の付く日で土曜日は割引率更にアップ！！」を追加表示

[実行結果1]
今日は1日(土)
商品の金額は9260円です
土曜日は割引率アップ！
割引率は39%です
割引される金額は3611.4円です

[実行結果2]
今日は5日(土)
商品の金額は9260円です
5の付く日で土曜日は割引率更にアップ！！
割引率は49%です
割引される金額は4537.400000000001円です
*/

public class Q03 {

	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ

	}

}
